//const arr = ['a','b','c']; // Мвссив

// const arrObj = {
// a: 'a',
// 1: 'b',
// 2: 'c',
// abc: {
//     df:[{}, {}],
//     def:{
        

//         }
//     }
// };

// const b = 'b';
// arrObj[b] = '1234'; //Добавить обьекты нужно как 'строку' или же ранее обьявить переменную.

//arrObj.b = '1234';  //Добовление Обьектов в скобках и через точку
//arrObj['b'] = '1234'; //Добовление Обьектов в скобках и через точку, Добавить обьекты нужно как 'строку' или же ранее обьявить переменную.

//console.log(arrObj['b']); // Обявление Обьектов в скобках и через точку
//console.log(arrObj.b); // Обявление Обьектов в скобках и через точку

//const obj = {
  //   Anna: 500, // Записывать можно и с ковычками и без ковычек.
   // 'Alice': 800
   // };

/*const storeName = 'Bazar Store';

const storeDescription = {
    
    budget: 10000,
    employees: ['Anna', 'Leyla','Nigar'],
    products: {
        'товар': Lays,
        'цена': 10,
    },

    open: true,
};*/



